; С помощью функций высшего порядка (map, foldl, foldr, filter, …) описать функцию, принимающую список
; из >= двух непустых подсписков неотрицательных чисел. Функция вычисляет среднее геометрическое каждого
; подсписка, затем получившийся список средних рассматривает как геометрический вектор и возвращает его
; длину [длина понимается в геометрическом смысле, в алгебраическом смысле это норма].

#lang racket
(define (task3 lst)
  (define (geommean sublist)
    (expt (foldl * 1 sublist) (/ 1 (length sublist))))
  (sqrt (foldl (lambda (x sum) (+ sum (* x x))) 0 (map geommean lst))))