; Пусть вызов (rot-right! v) перераспределяет значения мутируемого вектора
; в соответствии с циклическим сдвигом элементов вектора вправо

#lang racket

; 1) Реализация функцией
(define (rot-right! v)
  (let ((n (vector-length v))) ; длина вектора
    (if (> n 1)
        (let ((last (vector-ref v (sub1 n)))) ; сохраним последний элемент вектора
          (let loop ((i (sub1 n))) ; циклом идем справа налево, чтобы не перезаписать нужные нам элементы
            (if (= i 0) (vector-set! v 0 last)
                (begin
                  (vector-set! v i (vector-ref v (sub1 i)))
                  (loop (sub1 i))
                )
            )
          )
        )
       (void)
    )
  )
)

; 2) Реализация макросом
(define-syntax rot-right!
  (syntax-rules ()
    ((_ v) ; имя можно не писать, нас интересуют только аргументы
     (let ((vec v))
       (let ((n (vector-length vec))) ; длина вектора
         (if (> n 1)
             (let ((last (vector-ref vec (sub1 n)))) ; сохраним последний элемент вектора
               (let loop ((i (sub1 n))) ; циклом идем справа налево, чтобы не перезаписать нужные нам элементы
                 (if (= i 0) (vector-set! vec 0 last)
                     (begin
                       (vector-set! vec i (vector-ref vec (sub1 i)))
                       (loop (sub1 i))
                       )
                     )
                 )
               )
             (void)
           )
         )
       )
    )
  )
)

; 3) В данном случае уместнее использовать функцию, а не макрос, поскольку
; требуется изменить содержимое вектора, а не связывание переменной,
; которая на него ссылается. При вызове (rot-right! v) функция получает
; ссылку на тот же изменяемый вектор, на который ссылается v.