; Для натурального n возвращает сумму первых n членов последовательности
; 5 12 21 32 45 ... n*(n+4), а для остальных n – 0

#lang racket
; линейно итеративный процесс с именованным let
(define (task2a n)
  (if (and (integer? n) (>= n 0))
      (let loop ((i n) (result 0))
        (if (= i 0) result
              (loop (- i 1) (+ result (* i (+ i 4))))))
      0))

; линейно рекурсивный процесс
(define (task2b n)
  (if (and (integer? n) (>= n 0))
      (+ (* n (+ n 4)) (task2b (- n 1)))
      0))

; без цикла (считает за константу)
; надо посчитать сумму двух рядов
(define (task2c n)
  (if (and (integer? n) (>= n 0))
      (/ (* n (* (+ n 1) (+ 13 (* n 2)))) 6)
      0))